Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/atdf/PIC32MM0064GPL028.atdf
      <value-group caption="Comparator Output Enable bit" name="CM2CON__COE">
         <value caption="Comparator output is driven on the output CxOUT pin" name="" value="0x1" />
         <value caption="Comparator output is not driven on the output CxOUT pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Comparator ON bit" name="CM2CON__ON">
         <value caption="Module is enabled. Setting this bit does not affect the other bits in this register" name="" value="0x1" />
         <value caption="Module is disabled and does not consume current. Clearing this bit does not affect the other bits in this register" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="00000" name="CORE" version="">
      <register-group name="CORE" />
   </module>
   <module caption="" id="02672" name="CRC" version="">
      <register-group name="CRC">
         <register caption="" name="CRCCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="" mask="0x00000004" name="MOD" />
            <bitfield caption="" mask="0x00000008" name="LENDIAN" />
            <bitfield caption="" mask="0x00000010" name="CRCGO" />
            <bitfield caption="" mask="0x00000020" name="CRCISEL" />
            <bitfield caption="" mask="0x00000040" name="CRCMPT" />
            <bitfield caption="" mask="0x00000080" name="CRCFUL" />
            <bitfield caption="" mask="0x00001F00" name="VWORD" />
            <bitfield caption="" mask="0x00002000" name="SIDL" />
            <bitfield caption="" mask="0x00008000" name="ON" />
            <bitfield caption="" mask="0x001F0000" name="PLEN" />
            <bitfield caption="" mask="0x1F000000" name="DWIDTH" />
         </register>
         <register caption="" name="CRCXOR" offset="0x10" rw="RW" size="4">
            <bitfield caption="" mask="0x00000002" name="X1" />
            <bitfield caption="" mask="0x00000004" name="X2" />
            <bitfield caption="" mask="0x00000008" name="X3" />
            <bitfield caption="" mask="0x00000010" name="X4" />
            <bitfield caption="" mask="0x00000020" name="X5" />
            <bitfield caption="" mask="0x00000040" name="X6" />
            <bitfield caption="" mask="0x00000080" name="X7" />
            <bitfield caption="" mask="0x00000100" name="X8" />
            <bitfield caption="" mask="0x00000200" name="X9" />
            <bitfield caption="" mask="0x00000400" name="X10" />
            <bitfield caption="" mask="0x00000800" name="X11" />
            <bitfield caption="" mask="0x00001000" name="X12" />
            <bitfield caption="" mask="0x00002000" name="X13" />
            <bitfield caption="" mask="0x00004000" name="X14" />
            <bitfield caption="" mask="0x00008000" name="X15" />
            <bitfield caption="" mask="0x00010000" name="X16" />
            <bitfield caption="" mask="0x00020000" name="X17" />
            <bitfield caption="" mask="0x00040000" name="X18" />
            <bitfield caption="" mask="0x00080000" name="X19" />
            <bitfield caption="" mask="0x00100000" name="X20" />
            <bitfield caption="" mask="0x00200000" name="X21" />
            <bitfield caption="" mask="0x00400000" name="X22" />
            <bitfield caption="" mask="0x00800000" name="X23" />
            <bitfield caption="" mask="0x01000000" name="X24" />
            <bitfield caption="" mask="0x02000000" name="X25" />
            <bitfield caption="" mask="0x04000000" name="X26" />
            <bitfield caption="" mask="0x08000000" name="X27" />
            <bitfield caption="" mask="0x10000000" name="X28" />
            <bitfield caption="" mask="0x20000000" name="X29" />
            <bitfield caption="" mask="0x40000000" name="X30" />
            <bitfield caption="" mask="0x80000000" name="X31" />
         </register>
         <register caption="" name="CRCDAT" offset="0x20" rw="W" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="CRCDAT" />
         </register>
         <register caption="" name="CRCWDAT" offset="0x30" rw="RW" size="4">
            <bitfield caption="" mask="0xFFFFFFFF" name="CRCWDAT" />
         </register>
      </register-group>
   </module>
   <module caption="" id="02823" name="CRU" version="">
      <register-group name="CRU">
         <register caption="Oscillator Control Register" name="OSCCON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Oscillator Switch Enable bit" mask="0x00000001" name="OSWEN" values="OSCCON__OSWEN" />
            <bitfield caption="Secondary Oscillator Enable bit" mask="0x00000002" name="SOSCEN" values="OSCCON__SOSCEN" />
            <bitfield caption="Clock Fail Detect bit" mask="0x00000008" name="CF" values="OSCCON__CF" />
            <bitfield caption="Sleep Mode Enable bit" mask="0x00000010" name="SLPEN" values="OSCCON__SLPEN" />
            <bitfield caption="Clock Selection Lock Enable bit" mask="0x00000080" name="CLKLOCK" values="OSCCON__CLKLOCK" />
            <bitfield caption="New Oscillator Selection bits" mask="0x00000700" name="NOSC" values="OSCCON__NOSC" />
            <bitfield caption="Current Oscillator Selection bits" mask="0x00007000" name="COSC" values="OSCCON__COSC" />
            <bitfield caption="Internal Fast RC Oscillator Clock Divider bits" mask="0x07000000" name="FRCDIV" values="OSCCON__FRCDIV" />
         </register>
         <register caption="System PLL Control Register" name="SPLLCON" offset="0x20" rw="RW" size="4">
            <bitfield caption="System PLL Input Clock Source bit" mask="0x00000080" name="PLLICLK" values="SPLLCON__PLLICLK" />
            <bitfield caption="System PLL Multiplier bits" mask="0x007F0000" name="PLLMULT" values="SPLLCON__PLLMULT" />
            <bitfield caption="System PLL Output Clock Divider bits" mask="0x07000000" name="PLLODIV" values="SPLLCON__PLLODIV" />
         </register>
         <register caption="Reference Oscillator Control Register" name="REFO1CON" offset="0xa0" rw="RW" size="4">
            <bitfield caption="Reference Clock Source Select bits" mask="0x0000000F" name="ROSEL" values="REFO1CON__ROSEL" />
            <bitfield caption="Reference Clock Request Status bit" mask="0x00000100" name="ACTIVE" values="REFO1CON__ACTIVE" />
            <bitfield caption="Divider Switch Enable bit" mask="0x00000200" name="DIVSWEN" values="REFO1CON__DIVSWEN" />
            <bitfield caption="Reference Oscillator Module Run in Sleep bit" mask="0x00000800" name="RSLP" values="REFO1CON__RSLP" />
            <bitfield caption="Reference Clock Output Enable bit" mask="0x00001000" name="OE" values="REFO1CON__OE" />
            <bitfield caption="Peripheral Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="REFO1CON__SIDL" />
            <bitfield caption="Output Enable bit" mask="0x00008000" name="ON" values="REFO1CON__ON" />
            <bitfield caption="" mask="0x7FFF0000" name="RODIV" values="REFO1CON__RODIV" />
         </register>
         <register caption="Reference Oscillator Trim Register" name="REFO1TRIM" offset="0xb0" rw="RW" size="4">
            <bitfield caption="Reference Oscillator Trim bits" mask="0xFF800000" name="ROTRIM" values="REFO1TRIM__ROTRIM" />
         </register>
         <register caption="Oscillator Clock Status Register" name="CLKSTAT" offset="0xf0" rw="RW" size="4">
            <bitfield caption="Fast RC (FRC) Oscillator Ready Status bit" mask="0x00000001" name="FRCRDY" values="CLKSTAT__FRCRDY" />
            <bitfield caption="System PLL Ready Status bit" mask="0x00000002" name="SPDIVRDY" values="CLKSTAT__SPDIVRDY" />
            <bitfield caption="Primary Oscillator (POSC) Ready Status bit" mask="0x00000004" name="POSCRDY" values="CLKSTAT__POSCRDY" />
            <bitfield caption="Secondary Oscillator (SOSC) Ready Status bit" mask="0x00000010" name="SOSCRDY" values="CLKSTAT__SOSCRDY" />
            <bitfield caption="Low-Power RC (LPRC) Oscillator Ready Status bit" mask="0x00000020" name="LPRCRDY" values="CLKSTAT__LPRCRDY" />
            <bitfield caption="System PLL (SPLL) Ready Status bit" mask="0x00000080" name="SPLLRDY" values="CLKSTAT__SPLLRDY" />
         </register>
         <register caption="FRC Tuning Register" name="OSCTUN" offset="0x200" rw="RW" size="4">
            <bitfield caption="FRC Oscillator Tuning bits" mask="0x0000003F" name="TUN" values="OSCTUN__TUN" />
         </register>
      </register-group>
