Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MM_GPL_DFP/1.3.57/atdf/PIC32MM0064GPL028.atdf
      <value-group caption="Oscillator Switch Enable bit" name="OSCCON__OSWEN">
         <value caption="Initiate an oscillator switch to selection specified by NOSC bits" name="" value="0x1" />
         <value caption="Oscillator switch is complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Secondary Oscillator Enable bit" name="OSCCON__SOSCEN">
         <value caption="Enable Secondary Oscillator" name="ON" value="0x1" />
         <value caption="Disable Secondary Oscillator" name="OFF" value="0x0" />
      </value-group>
      <value-group caption="Clock Fail Detect bit" name="OSCCON__CF">
         <value caption="FSCM has detected a clock failure" name="" value="0x1" />
         <value caption="No clock failure has been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Sleep Mode Enable bit" name="OSCCON__SLPEN">
         <value caption="Device will enter Sleep mode when a WAIT instruction is executed" name="" value="0x1" />
         <value caption="Device will enter Idle mode when a WAIT instruction is executed" name="" value="0x0" />
      </value-group>
      <value-group caption="Clock Selection Lock Enable bit" name="OSCCON__CLKLOCK">
         <value caption="Clock and PLL selections are locked" name="" value="0x1" />
         <value caption="Clock and PLL selections are not locked and may be modified" name="" value="0x0" />
      </value-group>
      <value-group caption="New Oscillator Selection bits" name="OSCCON__NOSC">
         <value caption="Reserved" name="Reserved" value="0x7" />
         <value caption="Reserved" name="Reserved" value="0x6" />
         <value caption="Internal Low-Power RC (LPRC) Oscillator" name="LPRC" value="0x5" />
         <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x4" />
         <value caption="Reserved" name="Reserved" value="0x3" />
         <value caption="Primary Oscillator (POSC) (HS or EC)" name="PRI" value="0x2" />
         <value caption="System PLL (SPLL)" name="PRIPLL" value="0x1" />
         <value caption="Internal Fast RC (FRC) Oscillator divided by FRCDIV bits (FRCDIV)" name="FRCDIV" value="0x0" />
      </value-group>
      <value-group caption="Current Oscillator Selection bits" name="OSCCON__COSC">
         <value caption="Reserved" name="Reserved" value="0x7" />
         <value caption="Reserved" name="Reserved" value="0x6" />
         <value caption="Internal Low-Power RC (LPRC) Oscillator" name="LPRC" value="0x5" />
         <value caption="Secondary Oscillator (SOSC)" name="SOSC" value="0x4" />
         <value caption="Reserved" name="Reserved" value="0x3" />
         <value caption="Primary Oscillator (POSC) (HS or EC)" name="PRI" value="0x2" />
         <value caption="System PLL (SPLL)" name="PRIPLL" value="0x1" />
         <value caption="Internal Fast RC (FRC) Oscillator divided by FRCDIV bits (FRCDIV)" name="FRCDIV" value="0x0" />
      </value-group>
      <value-group caption="Internal Fast RC Oscillator Clock Divider bits" name="OSCCON__FRCDIV">
         <value caption="FRC divided by 256" name="DIV_256" value="0x7" />
         <value caption="FRC divided by 64" name="DIV_64" value="0x6" />
         <value caption="FRC divided by 32" name="DIV_32" value="0x5" />
         <value caption="FRC divided by 16" name="DIV_16" value="0x4" />
         <value caption="FRC divided by 8" name="DIV_8" value="0x3" />
         <value caption="FRC divided by 4" name="DIV_4" value="0x2" />
         <value caption="FRC divided by 2" name="DIV_2" value="0x1" />
         <value caption="FRC divided by 1 (default setting)" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="System PLL Input Clock Source bit" name="SPLLCON__PLLICLK">
         <value caption="FRC is selected as the input to the System PLL" name="" value="0x1" />
         <value caption="POSC is selected as the input to the System PLL" name="" value="0x0" />
      </value-group>
      <value-group caption="System PLL Multiplier bits" name="SPLLCON__PLLMULT">
         <value caption="Multiply by 24" name="MUL_24" value="0x6" />
         <value caption="Multiply by 12" name="MUL_12" value="0x5" />
         <value caption="Multiply by 8" name="MUL_8" value="0x4" />
         <value caption="Multiply by 6" name="MUL_6" value="0x3" />
         <value caption="Multiply by 4" name="MUL_4" value="0x2" />
         <value caption="Multiply by 3" name="MUL_3" value="0x1" />
         <value caption="Multiply by 2" name="MUL_2" value="0x0" />
      </value-group>
      <value-group caption="System PLL Output Clock Divider bits" name="SPLLCON__PLLODIV">
         <value caption="PLL Divide by 256" name="DIV_256" value="0x7" />
         <value caption="PLL Divide by 64" name="DIV_64" value="0x6" />
         <value caption="PLL Divide by 32" name="DIV_32" value="0x5" />
         <value caption="PLL Divide by 16" name="DIV_16" value="0x4" />
         <value caption="PLL Divide by 8" name="DIV_8" value="0x3" />
         <value caption="PLL Divide by 4" name="DIV_4" value="0x2" />
         <value caption="PLL Divide by 2" name="DIV_2" value="0x1" />
         <value caption="PLL Divide by 1" name="DIV_1" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Source Select bits" name="REFO1CON__ROSEL">
         <value caption="Reserved" name="Reserved" value="0xf" />
         <value caption="Reserved" name="Reserved" value="0xe" />
         <value caption="Reserved" name="Reserved" value="0xd" />
         <value caption="Reserved" name="Reserved" value="0xc" />
         <value caption="Reserved" name="Reserved" value="0xb" />
         <value caption="Reserved" name="Reserved" value="0xa" />
         <value caption="REFCLKI" name="REFCLKI" value="0x9" />
         <value caption="System PLL VCO output" name="Fvco" value="0x7" />
         <value caption="SOSC" name="SOSC" value="0x5" />
         <value caption="LPRC" name="LPRC" value="0x4" />
         <value caption="FRC" name="FRC" value="0x3" />
         <value caption="POSC" name="POSC" value="0x2" />
         <value caption="SYSCLK" name="SYSCLK" value="0x0" />
      </value-group>
      <value-group caption="Reference Clock Request Status bit" name="REFO1CON__ACTIVE">
         <value caption="Reference clock request is active" name="" value="0x1" />
         <value caption="Reference clock request is not active" name="" value="0x0" />
      </value-group>
      <value-group caption="Divider Switch Enable bit" name="REFO1CON__DIVSWEN">
         <value caption="Divider switch is in progress" name="" value="0x1" />
         <value caption="Divider switch is complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Reference Oscillator Module Run in Sleep bit" name="REFO1CON__RSLP">
         <value caption="Reference Oscillator Module output continues to run in Sleep" name="" value="0x1" />
         <value caption="Reference Oscillator Module output is disabled in Sleep" name="" value="0x0" />
      </value-group>
